In [13]:
import pandas as pd

In [120]:
#series de pandas 
data = {
    'Nombre': ['Juan', 'Ana', 'Jose', 'Arturo'],
    'Edad': [25, 18, 23, 27],
    'Pais': ['MX', 'CO', 'BR', 'MX'],
    'Ciudad': ['CDMX', 'BOG', 'RIO', 'CDMX']
}
data

{'Nombre': ['Juan', 'Ana', 'Jose', 'Arturo'],
 'Edad': [25, 18, 23, 27],
 'Pais': ['MX', 'CO', 'BR', 'MX'],
 'Ciudad': ['CDMX', 'BOG', 'RIO', 'CDMX']}

In [121]:
df = pd.DataFrame(data)
df

   Nombre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
1     Ana    18   CO    BOG
2    Jose    23   BR    RIO
3  Arturo    27   MX   CDMX

In [41]:
#exportar a csv
df.to_csv('data.csv', index=False)#index_col=0

In [42]:
#importar csv
import_df = pd.read_csv('data.csv')
import_df

   Nombre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
1     Ana    18   CO    BOG
2    Jose    23   BR    RIO
3  Arturo    27   MX   CDMX

In [ ]:
# seleccionar columnas
nombres = df['Nomre']
nombres

'Ana'

In [26]:
# seleccionar varias columnas
datos = df[['Nomre', 'Edad']]
datos, type(datos)

(    Nomre  Edad
 0    Juan    25
 1     Ana    18
 2    Jose    23
 3  Arturo    27,
 pandas.core.frame.DataFrame)

In [28]:
#filtrar por indice
fila = df.loc[1]
fila

Nomre     Ana
Edad       18
Pais       CO
Ciudad    BOG
Name: 1, dtype: object

In [29]:
# filtrar por condicion 
df[df['Edad'] > 20]

    Nomre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
2    Jose    23   BR    RIO
3  Arturo    27   MX   CDMX

In [30]:
df[(df['Edad'] > 20) & (df['Pais'] == 'MX')]

    Nomre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
3  Arturo    27   MX   CDMX

In [44]:
filtro = (df['Edad'] > 20) & (df['Pais'] == 'MX') & (df['Nombre'].str.startswith('A'))
df[filtro]

   Nombre  Edad Pais Ciudad
3  Arturo    27   MX   CDMX

In [45]:
# Filtarr por Query
df.query('Edad > 20 and Pais == "MX" and Nombre.str.startswith("A")', engine='python')

   Nombre  Edad Pais Ciudad
3  Arturo    27   MX   CDMX

In [46]:
df[df['Nombre'].isin(['Juan', 'Ana'])]

  Nombre  Edad Pais Ciudad
0   Juan    25   MX   CDMX
1    Ana    18   CO    BOG

In [48]:
# Con Funciones 
def longitud_5(x):
    return len(x) == 3

df[df['Nombre'].apply(longitud_5)]

  Nombre  Edad Pais Ciudad
1    Ana    18   CO    BOG

In [49]:
# Filtrar por rango incluyendo los extremos
df[df['Edad'].between(20, 25)]

  Nombre  Edad Pais Ciudad
0   Juan    25   MX   CDMX
2   Jose    23   BR    RIO

In [2]:
import numpy as np
import pandas as pd

In [59]:
# imputaicón de valores nulos
data = {
    'Nombre': ['Juan', 'Ana', 'Jose', 'Arturo'],
    'Edad': [25, 18, 23, np.nan],
    'Pais': ['MX', None, 'BR', 'MX'],
    'Ciudad': ['CDMX', 'BOG', 'RIO', None ]
}
df = pd.DataFrame(data)
df

   Nombre  Edad  Pais Ciudad
0    Juan  25.0    MX   CDMX
1     Ana  18.0  None    BOG
2    Jose  23.0    BR    RIO
3  Arturo   NaN    MX   None

In [54]:
# rellenar valores nulos
df_fill = df.fillna(
    {
    'Edad': df['Edad'].mean(),
    'Ciudad': 'Desconocido'
}
)
df_fill

   Nombre  Edad Pais       Ciudad
0    Juan  25.0   MX         CDMX
1     Ana  18.0   CO          BOG
2    Jose  23.0   BR          RIO
3  Arturo  22.0   MX  Desconocido

In [55]:
# Eliminar filas con valores nulos
df_sin_nulos = df.dropna()
df_sin_nulos

  Nombre  Edad Pais Ciudad
0   Juan  25.0   MX   CDMX
1    Ana  18.0   CO    BOG
2   Jose  23.0   BR    RIO

In [60]:
# Remplazar valores especificos
df_reemplazo = df.replace(
    {
        'Pais': {
            None: 'Desconocido',    
            'MX': 'Mexico',
            'CO': 'Colombia',
            'BR': 'Brasil'
        }
    }
)
df_reemplazo

   Nombre  Edad         Pais Ciudad
0    Juan  25.0       Mexico   CDMX
1     Ana  18.0  Desconocido    BOG
2    Jose  23.0       Brasil    RIO
3  Arturo   NaN       Mexico   None

In [61]:
# interpolación de valores
df_interpolacion = df.copy()
df_interpolacion['Edad'] = df_interpolacion['Edad'].interpolate()
df_interpolacion

   Nombre  Edad  Pais Ciudad
0    Juan  25.0    MX   CDMX
1     Ana  18.0  None    BOG
2    Jose  23.0    BR    RIO
3  Arturo  23.0    MX   None

In [62]:
data_duplicados = {
    'Nombre': ['Juan', 'Ana', 'Jose', 'Arturo', 'Juan', 'Ana'],
    'Edad': [25, 18, 23, 27, 25 , 18],
    'Pais': ['MX', 'CO', np.nan, 'MX', 'MX', 'CO'],
    'Ciudad': ['CDMX', 'BOG', 'RIO', None, 'CDMX', 'BOG']
}
df_duplicados = pd.DataFrame(data_duplicados)
df_duplicados

   Nombre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
1     Ana    18   CO    BOG
2    Jose    23  NaN    RIO
3  Arturo    27   MX   None
4    Juan    25   MX   CDMX
5     Ana    18   CO    BOG

In [63]:
# Eliminar duplicados
df_sin_duplicados = df_duplicados.drop_duplicates()
df_sin_duplicados

   Nombre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
1     Ana    18   CO    BOG
2    Jose    23  NaN    RIO
3  Arturo    27   MX   None

In [65]:
# Cambiar el nombre de las columnas
df_renombrar = df.rename(
    columns={
        'Nombre': 'nombre',
        'Edad': 'edad',
        'Pais': 'pais',
        'Ciudad': 'ciudad'
    }
)
df_renombrar

   nombre  edad  pais ciudad
0    Juan  25.0    MX   CDMX
1     Ana  18.0  None    BOG
2    Jose  23.0    BR    RIO
3  Arturo   NaN    MX   None

In [66]:
# Cambiar el orden de las columnas
df_reordenar = df[['Ciudad', 'Pais', 'Nombre', 'Edad']]
df_reordenar

  Ciudad  Pais  Nombre  Edad
0   CDMX    MX    Juan  25.0
1    BOG  None     Ana  18.0
2    RIO    BR    Jose  23.0
3   None    MX  Arturo   NaN

In [71]:
data ={
    'Nombre':['Juan', 'Ana', 'Jose', 'Arturo', 'Pedro', 'Maria'],
    'Ciudad':['CDMX', 'CDMX', 'BOG', 'RIO', 'CDMX', 'BOG'],
    'Edad':[25, 18, 23, 27, 25, 18],
    'Puntuacion':[80, 75, 85, 90, 80, 75]
}
df = pd.DataFrame(data)
df

   Nombre Ciudad  Edad  Puntuacion
0    Juan   CDMX    25          80
1     Ana   CDMX    18          75
2    Jose    BOG    23          85
3  Arturo    RIO    27          90
4   Pedro   CDMX    25          80
5   Maria    BOG    18          75

In [77]:
# Agrupar datos 
grouped = df.groupby('Ciudad')
grouped.groups

{'BOG': [2, 5], 'CDMX': [0, 1, 4], 'RIO': [3]}

In [78]:
# Calcular la suma de las edades y puntuaciones por ciudad
aggregated_data = grouped.agg(
    {
        'Edad': 'mean',
        'Puntuacion': 'sum'
    }
)
aggregated_data

             Edad  Puntuacion
Ciudad
BOG     20.500000         160
CDMX    22.666667         235
RIO     27.000000          90

In [80]:
# Definir una función para agregar datos personalizados
def rango(series):
    return series.max() - series.min()

aggregated_data_custom = grouped.agg({
    'Edad': rango,
    'Puntuacion': rango
})

aggregated_data_custom

        Edad  Puntuacion
Ciudad
BOG        5          10
CDMX       7           5
RIO        0           0

In [81]:
# Agregacion de datos en multiples columnas 
data['Categoria'] = ['A', 'B', 'A', 'B', 'A', 'B']
df = pd.DataFrame(data)
df

   Nombre Ciudad  Edad  Puntuacion Categoria
0    Juan   CDMX    25          80         A
1     Ana   CDMX    18          75         B
2    Jose    BOG    23          85         A
3  Arturo    RIO    27          90         B
4   Pedro   CDMX    25          80         A
5   Maria    BOG    18          75         B

In [83]:
# Agrupar por ciudad y categoria
grouped_multi = df.groupby(['Ciudad', 'Categoria'])
grouped_multi.groups

{('BOG', 'A'): [2], ('BOG', 'B'): [5], ('CDMX', 'A'): [0, 4], ('CDMX', 'B'): [1], ('RIO', 'B'): [3]}

In [85]:
# Calcular la suma de las edades y puntuaciones por ciudad y categoria
aggregated_data_multi = grouped_multi.agg(
    {
        'Edad': 'sum',
        'Puntuacion': 'sum'
    }
)
aggregated_data_multi

                  Edad  Puntuacion
Ciudad Categoria
BOG    A            23          85
       B            18          75
CDMX   A            50         160
       B            18          75
RIO    B            27          90

In [4]:
# Agregar nuevos datos a un dataframe
nuevos_datos = {
    'Nombre': ['Carlos', 'Luis'],
    'Ciudad': ['CDMX', 'BOG'],
    'Edad': [22, 19],
    'Puntuacion': [85, 95]
}
df = pd.DataFrame(nuevos_datos)
df

   Nombre Ciudad  Edad  Puntuacion
0  Carlos   CDMX    22          85
1    Luis    BOG    19          95

In [96]:
df['Categoria'] = ['A', 'B']
df

   Nombre Ciudad  Edad  Puntuacion Categoria
0  Carlos   CDMX    22          85         A
1    Luis    BOG    19          95         B

In [5]:
#Agregar una fila a un dataframe
new_row = pd.Series({'Nombre':'Adrian', 'Ciudad':'Barcelona','Edad': 22,'Puntuacion': 85})

# Agregar una fila a un dataframe
df = pd.concat([df, new_row.to_frame().T], ignore_index=True)
df

   Nombre     Ciudad Edad Puntuacion
0  Carlos       CDMX   22         85
1    Luis        BOG   19         95
2  Adrian  Barcelona   22         85

In [6]:
# Combinar dataframes
data1 = {
    'Nombre': ['Juan', 'Ana', 'Jose', 'Arturo'],
    'Edad': [25, 18, 23, 27],
    'Pais': ['MX', 'CO', 'BR', 'MX'],
    'Ciudad': ['CDMX', 'BOG', 'RIO', 'CDMX']
}
df1 = pd.DataFrame(data1)

data2 = {
    'Nombre': ['Pedro', 'Maria', 'Carlos', 'Luis'],
    'Edad': [25, 18, 23, 27],
    'Pais': ['MX', 'CO', 'BR', 'MX'],
    'Ciudad': ['CDMX', 'BOG', 'RIO', 'CDMX']
}
df2 = pd.DataFrame(data2)

In [7]:
df1

   Nombre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
1     Ana    18   CO    BOG
2    Jose    23   BR    RIO
3  Arturo    27   MX   CDMX

In [8]:
df2

   Nombre  Edad Pais Ciudad
0   Pedro    25   MX   CDMX
1   Maria    18   CO    BOG
2  Carlos    23   BR    RIO
3    Luis    27   MX   CDMX

In [9]:
df_combined = pd.concat([df1, df2], ignore_index=True)
df_combined

   Nombre  Edad Pais Ciudad
0    Juan    25   MX   CDMX
1     Ana    18   CO    BOG
2    Jose    23   BR    RIO
3  Arturo    27   MX   CDMX
4   Pedro    25   MX   CDMX
5   Maria    18   CO    BOG
6  Carlos    23   BR    RIO
7    Luis    27   MX   CDMX